{
  "economic_events": [
    {
      "type": "Leading Index",
      "comparison": "mom",
      "period": "Jul",
      "country": "US",
      "date": "2025-08-21 14:00:00",
      "actual": -0.1,
      "previous": -0.3,
      "estimate": -0.1,
      "change": 0.2,
      "change_percentage": 66.667
    },
    {
      "type": "Existing Home Sales",
      "comparison": "mom",
      "period": null,
      "country": "US",
      "date": "2025-08-21 14:00:00",
      "actual": 2,
      "previous": -2.7,
      "estimate": -0.2,
      "change": 4.7,
      "change_percentage": 174.074
    },
    {
      "type": "Housing Starts",
      "comparison": "mom",
      "period": "Jul",
      "country": "US",
      "date": "2025-08-19 12:30:00",
      "actual": 5.2,
      "previous": 5.9,
      "estimate": -2.2,
      "change": -0.7,
      "change_percentage": -11.864
    },
    {
      "type": "Retail Inventories Ex Autos",
      "comparison": "mom",
      "period": "Jun",
      "country": "US",
      "date": "2025-08-15 14:00:00",
      "actual": -0.1,
      "previous": 0.1,
      "estimate": null,
      "change": -0.2,
      "change_percentage": -200
    },
    {
      "type": "Business Inventories",
      "comparison": "mom",
      "period": "Jun",
      "country": "US",
      "date": "2025-08-15 14:00:00",
      "actual": 0.2,
      "previous": null,
      "estimate": 0.2,
      "change": 0.2,
      "change_percentage": null
    },
    {
      "type": "Manufacturing Production",
      "comparison": "mom",
      "period": "Jul",
      "country": "US",
      "date": "2025-08-15 13:15:00",
      "actual": null,
      "previous": 0.3,
      "estimate": -0.1,
      "change": -0.3,
      "change_percentage": -100
    },
    {
      "type": "Industrial Production",
      "comparison": "mom",
      "period": "Jul",
      "country": "US",
      "date": "2025-08-15 13:15:00",
      "actual": -0.1,
      "previous": 0.4,
      "estimate": null,
      "change": -0.5,
      "change_percentage": -125
    },
    {
      "type": "Export Prices",
      "comparison": "mom",
      "period": "Jul",
      "country": "US",
      "date": "2025-08-15 12:30:00",
      "actual": 0.1,
      "previous": 0.5,
      "estimate": 0.1,
      "change": -0.4,
      "change_percentage": -80
    },
    {
      "type": "Retail Sales",
      "comparison": "mom",
      "period": "Jul",
      "country": "US",
      "date": "2025-08-15 12:30:00",
      "actual": 0.5,
      "previous": 0.9,
      "estimate": 0.5,
      "change": -0.4,
      "change_percentage": -44.444
    },
    {
      "type": "Retail Sales Ex Gas/Autos",
      "comparison": "mom",
      "period": "Jul",
      "country": "US",
      "date": "2025-08-15 12:30:00",
      "actual": 0.2,
      "previous": 0.8,
      "estimate": 0.3,
      "change": -0.6,
      "change_percentage": -75
    },
    {
      "type": "Import Prices",
      "comparison": "mom",
      "period": "Jul",
      "country": "US",
      "date": "2025-08-15 12:30:00",
      "actual": 0.4,
      "previous": -0.1,
      "estimate": 0.2,
      "change": 0.5,
      "change_percentage": 500
    },
    {
      "type": "Retail Sales Ex Autos",
      "comparison": "mom",
      "period": "Jul",
      "country": "US",
      "date": "2025-08-15 12:30:00",
      "actual": 0.3,
      "previous": 0.8,
      "estimate": 0.3,
      "change": -0.5,
      "change_percentage": -62.5
    },
    {
      "type": "Core PPI",
      "comparison": "mom",
      "period": "Jul",
      "country": "US",
      "date": "2025-08-14 12:30:00",
      "actual": 0.9,
      "previous": null,
      "estimate": 0.2,
      "change": 0.9,
      "change_percentage": null
    },
    {
      "type": "Producer Price Index",
      "comparison": "mom",
      "period": "Jul",
      "country": "US",
      "date": "2025-08-14 12:30:00",
      "actual": 0.9,
      "previous": null,
      "estimate": 0.2,
      "change": 0.9,
      "change_percentage": null
    },
    {
      "type": "PPI Ex Food, Energy and Trade",
      "comparison": "mom",
      "period": "Jul",
      "country": "US",
      "date": "2025-08-14 12:30:00",
      "actual": 0.6,
      "previous": null,
      "estimate": 0.1,
      "change": 0.6,
      "change_percentage": null
    },
    {
      "type": "Core Inflation Rate",
      "comparison": "mom",
      "period": "Jul",
      "country": "US",
      "date": "2025-08-12 12:30:00",
      "actual": 0.3,
      "previous": 0.2,
      "estimate": 0.3,
      "change": 0.1,
      "change_percentage": 50
    },
    {
      "type": "Inflation Rate",
      "comparison": "mom",
      "period": "Jul",
      "country": "US",
      "date": "2025-08-12 12:30:00",
      "actual": 0.2,
      "previous": 0.3,
      "estimate": 0.2,
      "change": -0.1,
      "change_percentage": -33.333
    },
    {
      "type": "Real Earnings",
      "comparison": "mom",
      "period": "Jul",
      "country": "US",
      "date": "2025-08-12 12:30:00",
      "actual": 0.4,
      "previous": -0.3,
      "estimate": null,
      "change": 0.7,
      "change_percentage": 233.333
    },
    {
      "type": "Wholesale Inventories",
      "comparison": "mom",
      "period": "Jun",
      "country": "US",
      "date": "2025-08-07 14:00:00",
      "actual": 0.1,
      "previous": -0.3,
      "estimate": 0.1,
      "change": 0.4,
      "change_percentage": 133.333
    },
    {
      "type": "Wholesale Sales",
      "comparison": "mom",
      "period": "Jun",
      "country": "US",
      "date": "2025-08-07 14:00:00",
      "actual": 0.3,
      "previous": -0.4,
      "estimate": null,
      "change": 0.7,
      "change_percentage": 175
    },
    {
      "type": "Used Car Prices",
      "comparison": "mom",
      "period": "Jul",
      "country": "US",
      "date": "2025-08-07 13:00:00",
      "actual": -0.5,
      "previous": 1.6,
      "estimate": null,
      "change": -2.1,
      "change_percentage": -131.25
    },
    {
      "type": "Durable Goods Orders Ex Defense",
      "comparison": "mom",
      "period": null,
      "country": "US",
      "date": "2025-08-04 14:00:00",
      "actual": -9.4,
      "previous": 15.5,
      "estimate": -9.4,
      "change": -24.9,
      "change_percentage": -160.645
    },
    {
      "type": "Durable Goods Orders Ex Transp",
      "comparison": "mom",
      "period": null,
      "country": "US",
      "date": "2025-08-04 14:00:00",
      "actual": 0.2,
      "previous": 0.2,
      "estimate": null,
      "change": null,
      "change_percentage": null
    },
    {
      "type": "Factory Orders",
      "comparison": "mom",
      "period": "Jun",
      "country": "US",
      "date": "2025-08-04 14:00:00",
      "actual": -4.8,
      "previous": 8.3,
      "estimate": -4.9,
      "change": -13.1,
      "change_percentage": -157.831
    },
    {
      "type": "Construction Spending",
      "comparison": "mom",
      "period": "Jun",
      "country": "US",
      "date": "2025-08-01 14:00:00",
      "actual": -0.4,
      "previous": -0.4,
      "estimate": 0.1,
      "change": null,
      "change_percentage": null
    },
    {
      "type": "Average Hourly Earnings",
      "comparison": "mom",
      "period": "Jul",
      "country": "US",
      "date": "2025-08-01 12:30:00",
      "actual": 0.3,
      "previous": 0.2,
      "estimate": 0.3,
      "change": 0.1,
      "change_percentage": 50
    },
    {
      "type": "Personal Income",
      "comparison": "mom",
      "period": "Jun",
      "country": "US",
      "date": "2025-07-31 12:30:00",
      "actual": 0.3,
      "previous": -0.4,
      "estimate": 0.2,
      "change": 0.7,
      "change_percentage": 175
    },
    {
      "type": "Core PCE Price Index",
      "comparison": "mom",
      "period": "Jun",
      "country": "US",
      "date": "2025-07-31 12:30:00",
      "actual": 0.3,
      "previous": 0.2,
      "estimate": 0.3,
      "change": 0.1,
      "change_percentage": 50
    },
    {
      "type": "PCE Price Index",
      "comparison": "mom",
      "period": "Jun",
      "country": "US",
      "date": "2025-07-31 12:30:00",
      "actual": 0.3,
      "previous": 0.2,
      "estimate": 0.3,
      "change": 0.1,
      "change_percentage": 50
    },
    {
      "type": "Personal Spending",
      "comparison": "mom",
      "period": "Jun",
      "country": "US",
      "date": "2025-07-31 12:30:00",
      "actual": 0.3,
      "previous": null,
      "estimate": 0.4,
      "change": 0.3,
      "change_percentage": null
    }
  ],
  "news": [
    {
      "date": "2025-08-21T10:09:12+00:00",
      "title": "Is Reddit’s Triple-Digit Rally Justified After Latest Meme Stock Surge?",
      "content": "If you are having a hard time figuring out what to do with Reddit stock these days, you are absolutely not alone. In this fast-evolving market, Reddit (RDDT) has quickly become a poster child for volatility. One moment it is riding the meme stock wave, and the next it is catching analysts by surprise with its underlying numbers. Just in the past month, Reddit shares have soared nearly 49%, which is part of an eye-catching 122% jump over the past 90 days. That kind of move makes even seasoned investors sit up and pay attention.\n\nWhy the fireworks? A confluence of forces is at play. Over the last few weeks, Reddit has found itself at the center of renewed meme stock interest, as investors organized on social platforms (including Reddit itself!) have driven up not just RDDT, but also names like Kohl's and Opendoor. Meanwhile, the company has signaled openness to new technology such as World ID iris-scanning for user verification, hinting at ambitious plans to stay at the forefront of digital platforms. With yearly revenue and net income growth of 23.9% and 37.2% respectively, it is easy to see why growth-seekers are taking note, even if analysts remain a bit more cautious in their price targets.\n\nBut let’s not lose the script. Ultimately, all the headlines in the world come back to one thing: valuation. Is Reddit truly undervalued, or are the latest price surges just hype? According to our scorecard, Reddit scores a 2 out of 6 for key undervaluation checks, which is not a slam dunk but not stretched thin either. Next, we will break down these valuation methods in detail, before introducing an even more revealing way to think about what the stock is really worth.\n\nReddit delivered 283.8% returns over the last year. See how this stacks up to the rest of the Interactive Media and Services industry.\n\nApproach 1: Reddit Cash Flows\n\nThe Discounted Cash Flow (DCF) model estimates a business’s true worth by projecting its future free cash flows and discounting them back to today’s value. This approach gives investors an idea of what the company is really worth, regardless of market hype or swings in share price.\n\nReddit’s most recent Free Cash Flow is $390 million, which is notable for such a relatively new public company. Projections suggest strong growth ahead, with analysts forecasting that Reddit will generate more than $2.09 billion in annual free cash flow by the end of 2029. Over a ten-year span, the company’s FCF is expected to climb steadily, supported by increased engagement and monetization efforts on the platform.\n\nWeiterlesen\n\nBased on these cash flow projections and using a two-stage Free Cash Flow to Equity model, Reddit’s estimated intrinsic value is $301.24 per share. This figure is 27.5% above the current market price, which indicates that Reddit stock is 27.5% undervalued according to this method.\n\nFor investors relying on the numbers, Reddit’s discounted cash flow valuation suggests that there may be significant upside if these growth estimates are achieved.\n\nResult: UNDERVALUED RDDT Discounted Cash Flow as at Aug 2025\n\nOur DCF analysis suggests Reddit is undervalued by 27.5%. Track this in your watchlist or portfolio, or discover more undervalued stocks based on DCF analysis.\n\nApproach 2: Reddit Price vs Sales\n\nWhen it comes to valuing a business like Reddit, the Price-to-Sales (P/S) multiple offers a solid benchmark. This metric is particularly useful for fast-growing companies that are not yet consistently profitable, as it focuses on their ability to generate revenue rather than earnings, which can be inconsistent during a growth phase.\n\nThe “normal” or “fair” P/S ratio for a company is influenced by expectations for future growth and the risks involved. Faster sales growth can justify a higher P/S, while more uncertainty or weaker prospects usually result in a lower multiple.\n\nCurrently, Reddit is trading at a 24.5x P/S multiple. This is not only above the Interactive Media and Services industry average of 1.2x, but also considerably higher than the peer group average of 3.14x. At first glance, this might suggest Reddit is overpriced. Simply Wall St's proprietary Fair Ratio model, which accounts for Reddit's earnings outlook, market position, and specific risks, calculates a fair P/S ratio of 11.57x for the company.\n\nComparing the actual P/S of 24.5x with the Fair Ratio of 11.57x, Reddit stock currently appears expensive using this method. Unless earnings growth or margins increase more quickly than expected, investors may want to approach with caution at these levels.\n\nResult: OVERVALUED NYSE:RDDT PS Ratio as at Aug 2025\n\nPS ratios tell one story, but what if the real opportunity lies elsewhere? Discover companies where insiders are betting big on explosive growth.\n\nUpgrade Your Decision Making: Choose your Reddit Narrative\n\nInstead of relying solely on numbers or ratios, Narratives offer a more intuitive way to invest by connecting the story you see behind a company, like Reddit, to your own forecasts and fair value assumptions.\n\nA Narrative is simply the story you believe about a business and its future. For example, you might consider why you think Reddit will or will not grow, what could accelerate or block its progress, and how those factors shape your personal fair value estimate based on your expectations for revenue, profit margins, and growth.\n\nNarratives go beyond spreadsheets by linking your vision of the company to a specific financial forecast and a fair value. This approach can empower you to make buy or sell decisions by comparing your calculated value to the current share price.\n\nOn Simply Wall St, Narratives are easy to create, compare, and update, making them both accessible and dynamic. Every time new information like earnings or news arrives, Narratives adjust instantly so you always have a fresh perspective.\n\nFor instance, one investor’s Narrative might see Reddit’s global expansion and data licensing as reasons to estimate a fair value of $235 per share. Another, more cautious Narrative, considering risks like competition and moderation, lands at just $75 per share. This highlights how different perspectives can give rise to very different conclusions.\n\nDo you think there's more to the story for Reddit? Create your own Narrative to let the Community know!NYSE:RDDT Community Fair Values as at Aug 2025\n\nThis article by Simply Wall St is general in nature. We provide commentary based on historical data and analyst forecasts only using an unbiased methodology and our articles are not intended to be financial advice. It does not constitute a recommendation to buy or sell any stock, and does not take account of your objectives, or your financial situation. We aim to bring you long-term focused analysis driven by fundamental data. Note that our analysis may not factor in the latest price-sensitive company announcements or qualitative material. Simply Wall St has no position in any stocks mentioned.\n\nCompanies discussed in this article include RDDT.\n\nHave feedback on this article? Concerned about the content? Get in touch with us directly. Alternatively, email editorial-team@simplywallst.com\n\nKommentare anzeigen",
      "link": "https://finance.yahoo.com/news/reddit-triple-digit-rally-justified-100912514.html",
      "symbols": [
        "AAPL.US",
        "KHP.DU",
        "KHP.MU",
        "KSS.US",
        "MSFT.US",
        "OPEN.US",
        "RDDT.US"
      ],
      "tags": [
        "DISCOUNTED CASH FLOW",
        "EARNINGS GROWTH",
        "FREE CASH FLOW",
        "INTERACTIVE MEDIA AND SERVICES",
        "INTRINSIC VALUE",
        "NASDAQ",
        "NET INCOME",
        "REDDIT",
        "SHARE PRICE",
        "WORLD ID"
      ],
      "sentiment": {
        "polarity": 1,
        "neg": 0.029,
        "neu": 0.786,
        "pos": 0.185
      }
    },
    {
      "date": "2025-08-21T09:43:29+00:00",
      "title": "1 Unpopular Stock That Deserves Some Love and 2 That Underwhelm",
      "content": "Wall Street’s bearish price targets for the stocks in this article signal serious concerns. Such forecasts are uncommon in an industry where maintaining cordial corporate relationships often trumps delivering the hard truth.\n\nAt StockStory, we look beyond the headlines with our independent analysis to determine whether these bearish calls are justified. Keeping that in mind, here is one stock where Wall Street’s pessimism is creating a buying opportunity and two where the skepticism is well-placed.\n\nTwo Stocks to Sell:\n\nKohl's (KSS)\n\nConsensus Price Target: $10.07 (-25.3% implied return)\n\nFounded as a corner grocery store in Milwaukee, Wisconsin, Kohl’s (NYSE:KSS) is a department store chain that sells clothing, cosmetics, electronics, and home goods.\n\nWhy Is KSS Risky?\n\nPoor same-store sales performance over the past two years indicates it’s having trouble bringing new shoppers into its brick-and-mortar locations Sales are projected to tank by 5.2% over the next 12 months as its demand continues evaporating 6× net-debt-to-EBITDA ratio makes lenders less willing to extend additional capital, potentially necessitating dilutive equity offerings\n\nKohl’s stock price of $13.48 implies a valuation ratio of 50.7x forward P/E. To fully understand why you should be careful with KSS, check out our full research report (it’s free).\n\nTopgolf Callaway (MODG)\n\nConsensus Price Target: $10.50 (10.6% implied return)\n\nFormed between the merger of Callaway and Topgolf, Topgolf Callaway (NYSE:MODG) sells golf equipment and operates technology-driven golf entertainment venues.\n\nWhy Should You Dump MODG?\n\nWeak constant currency growth over the past two years indicates challenges in maintaining its market share Earnings per share fell by 39.2% annually over the last five years while its revenue grew, showing its incremental sales were much less profitable Waning returns on capital from an already weak starting point displays the inefficacy of management’s past and current investment decisions\n\nAt $9.49 per share, Topgolf Callaway trades at 3.8x forward EV-to-EBITDA. Read our free research report to see why you should think twice about including MODG in your portfolio, it’s free.\n\nOne Stock to Buy:\n\nHEICO (HEI)\n\nConsensus Price Target: $323.82 (4.9% implied return)\n\nFounded in 1957, HEICO (NYSE:HEI) manufactures and services aerospace and electronic components for commercial aviation, defense, space, and other industries.\n\nWhy Is HEI a Good Business?\n\nExisting business lines can expand without risky acquisitions as its organic revenue growth averaged 9.7% over the past two years Earnings per share grew by 25.2% annually over the last two years, massively outpacing its peers Strong free cash flow margin of 17.5% enables it to reinvest or return capital consistently\n\nStory Continues\n\nHEICO is trading at $308.76 per share, or 66.1x forward P/E. Is now a good time to buy? See for yourself in our comprehensive research report, it’s free.\n\nHigh-Quality Stocks for All Market Conditions\n\nDonald Trump’s April 2025 \"Liberation Day\" tariffs sent markets into a tailspin, but stocks have since rebounded strongly, proving that knee-jerk reactions often create the best buying opportunities.\n\nThe smart money is already positioning for the next leg up. Don’t miss out on the recovery - check out our Top 5 Strong Momentum Stocks for this week. This is a curated list of our High Quality stocks that have generated a market-beating return of 183% over the last five years (as of March 31st 2025).\n\nStocks that made our list in 2020 include now familiar names such as Nvidia (+1,545% between March 2020 and March 2025) as well as under-the-radar businesses like the once-micro-cap company Tecnoglass (+1,754% five-year return). Find your next big winner with StockStory today for free. Find your next big winner with StockStory today. Find your next big winner with StockStory today\n\nStockStory is growing and hiring equity analyst and marketing roles. Are you a 0 to 1 builder passionate about the markets and AI? See the open roles here.\n\nView Comments",
      "link": "https://finance.yahoo.com/news/1-unpopular-stock-deserves-love-094329926.html",
      "symbols": [
        "AAPL.US",
        "AMD.US",
        "HEI.US",
        "KHP.DU",
        "KHP.MU",
        "KSS.US",
        "MODG.US",
        "MSFT.US",
        "NVDA.US"
      ],
      "tags": [
        "DONALD TRUMP",
        "FREE CASH FLOW",
        "HEICO",
        "KOHL'S",
        "NAS",
        "NYSE",
        "NYSE:HEI",
        "REVENUE GROWTH",
        "TOPGOLF CALLAWAY",
        "WALL STREET"
      ],
      "sentiment": {
        "polarity": 0.998,
        "neg": 0.029,
        "neu": 0.818,
        "pos": 0.153
      }
    },
    {
      "date": "2025-08-20T16:59:00+00:00",
      "title": "Kohl's to Report Q2 Earnings: Essential Insights Ahead of the Report",
      "content": "Kohl's Corporation (KSS) is likely to report top and bottom-line declines when it reports second-quarter fiscal 2025 results on Aug. 27. The Zacks Consensus Estimate for quarterly sales is currently pegged at $3.48 billion, showing a 6.9% decrease from the year-ago quarter’s tally.\n\nThe consensus mark for earnings for the fiscal second quarter has been stable over the past 30 days at 33 cents a share. This reflects a year-over-year plunge of 44.1% from the year-earlier quarter.\n\nThe company delivered an earnings surprise of 18.8%, on average, in the trailing four quarters. In the last reported fiscal quarter, Kohl's recorded an earnings surprise of 40.9%.\n\nFactors Likely to Impact KSS’ Q2 Earnings\n\nKohl's has been bearing the brunt of ongoing macroeconomic uncertainty and a cautious consumer environment. The company faces persistent headwinds in its digital business, largely due to softness in the home category, particularly within its Legacy Home offerings, and intense online competition.\n\nKohl’s has been grappling with a tough operating backdrop, with external headwinds like shifting consumer behavior and unpredictable tariff developments adding to volatility. Our model suggests a comparable sales decline of 5.6% in the to-be-reported quarter.\n\nDespite ongoing challenges, Kohl’s has been making meaningful progress in underpenetrated categories such as home decor, gifting and baby products, which is likely to have provided some cushion in the fiscal second quarter. In addition, KSS’ strategic partnership with Sephora is expected to have contributed positively in the to-be-reported quarter.\n\nThe company’s continued emphasis on strategic growth initiatives — including enhancing the customer experience, optimizing inventory and maintaining effective cost management — bodes well. Our model anticipates an SG&A cost reduction of 6.1% for the second quarter.\n\nEarnings Whispers for KSS Stock\n\nOur proven model doesn’t conclusively predict an earnings beat for Kohl's this time. The combination of a positive Earnings ESP and a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold) increases the odds of an earnings beat, which is not the case here. You can uncover the best stocks before they’re reported with our Earnings ESP Filter.\n\nKohl's currently has an Earnings ESP of -20.17% and a Zacks Rank of 3.\n\nKohl's Corporation Price and EPS Surprise\n\nKohl's Corporation price-eps-surprise | Kohl's Corporation Quote\n\nStocks With the Favorable Combination\n\nHere are a few companies, which according to our model, have the right combination of elements to come up with an earnings beat this reporting cycle:\n\nStory Continues\n\nAbercrombie & Fitch Co. (ANF) has an Earnings ESP of +2.62% and a Zacks Rank of 3. ANF’s earnings for the second quarter of fiscal 2025 are expected to decrease 9.2% on a year-over-year basis. The consensus mark for its quarterly earnings has moved up 0.9% to $2.27 per share in the past 30 days. You can see the complete list of today’s Zacks #1 Rank stocks here.\n\nThe Zacks Consensus Estimate for Abercrombie & Fitch’s quarterly revenues is pegged at $1.19 billion, which suggests growth of 4.8% from the figure reported in the prior-year quarter. ANF has a trailing four-quarter earnings surprise of 11.2%, on average.\n\nThe Gap (GAP) currently has an Earnings ESP of +1.52% and a Zacks Rank of 3. GAP is likely to register a bottom-line increase when it reports second-quarter fiscal 2025 numbers. The Zacks Consensus Estimate for quarterly earnings per share of 55 cents indicates an increase of 1.9% from the year-ago fiscal quarter’s reported number.\n\nGAP’s top line is expected to improve from the prior-year fiscal quarter’s reported number. The consensus estimate for quarterly revenues is pegged at $3.74 billion, indicating growth of 0.5% from the prior-year fiscal quarter’s reported figure. GAP has a trailing four-quarter earnings surprise of 33.2%, on average.\n\nDICK'S Sporting Goods (DKS) currently has an Earnings ESP of +1.13% and a Zacks Rank of 3. The company is expected to register a bottom-line decrease when it reports second-quarter fiscal 2025 results. The Zacks Consensus Estimate for quarterly earnings per share of $4.29 indicates a dip of 1.8% from the year-ago quarter.\n\nThe consensus mark for revenues is pegged at $3.60 billion, indicating a rise of 3.6% from the figure reported in the year-ago quarter. DKS has a trailing four-quarter earnings surprise of 5.6%, on average.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nKohl's Corporation (KSS) : Free Stock Analysis Report\n\nAbercrombie & Fitch Company (ANF) : Free Stock Analysis Report\n\nDICK'S Sporting Goods, Inc. (DKS) : Free Stock Analysis Report\n\nThe Gap, Inc. (GAP) : Free Stock Analysis Report\n\nThis article originally published on Zacks Investment Research (zacks.com).\n\nZacks Investment Research\n\nView Comments",
      "link": "https://finance.yahoo.com/news/kohls-report-q2-earnings-essential-165900737.html",
      "symbols": [
        "AFT.BE",
        "AFT.DU",
        "AFT.F",
        "AFT.MU",
        "ANF.US",
        "DKS.US",
        "DSG.F",
        "DSG.MU",
        "GAP.BE",
        "GAP.DU",
        "GAP.F",
        "GAP.MU",
        "GAP.US",
        "KHP.DU"
      ],
      "tags": [
        "CAUTIOUS CONSUMER ENVIRONMENT",
        "CONSENSUS ESTIMATE",
        "CUSTOMER EXPERIENCE",
        "EARNINGS BEAT",
        "EARNINGS ESP FILTER",
        "EARNINGS PER SHARE",
        "EARNINGS PER SHARE SURPRISE",
        "EARNINGS SURPRISE",
        "EFFECTIVE COST MANAGEMENT",
        "FISCAL 2025 RESULTS",
        "FISCAL SECOND QUARTER",
        "MACROECONOMIC UNCERTAINTY",
        "OPERATING BACKDROP",
        "PRIOR-YEAR FISCAL QUARTER",
        "PRIOR-YEAR QUARTER",
        "QUARTERLY EARNINGS",
        "QUARTERLY REVENUES",
        "QUARTERLY SALES",
        "SECOND-QUARTER FISCAL 2025 NUMBERS"
      ],
      "sentiment": {
        "polarity": 0.998,
        "neg": 0.008,
        "neu": 0.873,
        "pos": 0.119
      }
    },
    {
      "date": "2025-08-20T14:00:02+00:00",
      "title": "Analysts Estimate Kohl's (KSS) to Report a Decline in Earnings: What to Look Out for",
      "content": "The market expects Kohl's (KSS) to deliver a year-over-year decline in earnings on lower revenues when it reports results for the quarter ended July 2025. This widely-known consensus outlook is important in assessing the company's earnings picture, but a powerful factor that might influence its near-term stock price is how the actual results compare to these estimates.\n\nThe earnings report, which is expected to be released on August 27, might help the stock move higher if these key numbers are better than expectations. On the other hand, if they miss, the stock may move lower.\n\nWhile the sustainability of the immediate price change and future earnings expectations will mostly depend on management's discussion of business conditions on the earnings call, it's worth handicapping the probability of a positive EPS surprise.\n\nZacks Consensus Estimate\n\nThis department store operator is expected to post quarterly earnings of $0.33 per share in its upcoming report, which represents a year-over-year change of -44.1%.\n\nRevenues are expected to be $3.48 billion, down 6.9% from the year-ago quarter.\n\nEstimate Revisions Trend\n\nThe consensus EPS estimate for the quarter has been revised 2.91% higher over the last 30 days to the current level. This is essentially a reflection of how the covering analysts have collectively reassessed their initial estimates over this period.\n\nInvestors should keep in mind that the direction of estimate revisions by each of the covering analysts may not always get reflected in the aggregate change.\n\nPrice, Consensus and EPS SurprisePrice, Consensus and EPS Surprise Chart for KSS\n\nEarnings Whisper\n\nEstimate revisions ahead of a company's earnings release offer clues to the business conditions for the period whose results are coming out. This insight is at the core of our proprietary surprise prediction model -- the Zacks Earnings ESP (Expected Surprise Prediction).\n\nThe Zacks Earnings ESP compares the Most Accurate Estimate to the Zacks Consensus Estimate for the quarter; the Most Accurate Estimate is a more recent version of the Zacks Consensus EPS estimate. The idea here is that analysts revising their estimates right before an earnings release have the latest information, which could potentially be more accurate than what they and others contributing to the consensus had predicted earlier.\n\nThus, a positive or negative Earnings ESP reading theoretically indicates the likely deviation of the actual earnings from the consensus estimate. However, the model's predictive power is significant for positive ESP readings only.\n\nA positive Earnings ESP is a strong predictor of an earnings beat, particularly when combined with a Zacks Rank #1 (Strong Buy), 2 (Buy) or 3 (Hold). Our research shows that stocks with this combination produce a positive surprise nearly 70% of the time, and a solid Zacks Rank actually increases the predictive power of Earnings ESP.\n\nStory Continues\n\nPlease note that a negative Earnings ESP reading is not indicative of an earnings miss. Our research shows that it is difficult to predict an earnings beat with any degree of confidence for stocks with negative Earnings ESP readings and/or Zacks Rank of 4 (Sell) or 5 (Strong Sell).\n\nHow Have the Numbers Shaped Up for Kohl's?\n\nFor Kohl's, the Most Accurate Estimate is lower than the Zacks Consensus Estimate, suggesting that analysts have recently become bearish on the company's earnings prospects. This has resulted in an Earnings ESP of -20.17%.\n\nOn the other hand, the stock currently carries a Zacks Rank of #3.\n\nSo, this combination makes it difficult to conclusively predict that Kohl's will beat the consensus EPS estimate.\n\nDoes Earnings Surprise History Hold Any Clue?\n\nWhile calculating estimates for a company's future earnings, analysts often consider to what extent it has been able to match past consensus estimates. So, it's worth taking a look at the surprise history for gauging its influence on the upcoming number.\n\nFor the last reported quarter, it was expected that Kohl's would post a loss of$0.22 per share when it actually produced a loss of -$0.13, delivering a surprise of +40.91%.\n\nOver the last four quarters, the company has beaten consensus EPS estimates three times.\n\nBottom Line\n\nAn earnings beat or miss may not be the sole basis for a stock moving higher or lower. Many stocks end up losing ground despite an earnings beat due to other factors that disappoint investors. Similarly, unforeseen catalysts help a number of stocks gain despite an earnings miss.\n\nThat said, betting on stocks that are expected to beat earnings expectations does increase the odds of success. This is why it's worth checking a company's Earnings ESP and Zacks Rank ahead of its quarterly release. Make sure to utilize our Earnings ESP Filter to uncover the best stocks to buy or sell before they've reported.\n\nKohl's doesn't appear a compelling earnings-beat candidate. However, investors should pay attention to other factors too for betting on this stock or staying away from it ahead of its earnings release.\n\nStay on top of upcoming earnings announcements with the Zacks Earnings Calendar.\n\nWant the latest recommendations from Zacks Investment Research? Today, you can download 7 Best Stocks for the Next 30 Days. Click to get this free report\n\nKohl's Corporation (KSS) : Free Stock Analysis Report\n\nThis article originally published on Zacks Investment Research (zacks.com).\n\nZacks Investment Research\n\nView Comments",
      "link": "https://finance.yahoo.com/news/analysts-estimate-kohls-kss-report-140002745.html",
      "symbols": [
        "KHP.DU",
        "KHP.MU",
        "KSS.US"
      ],
      "tags": [
        "CONSENSUS ESTIMATE",
        "EARNINGS RELEASE",
        "EARNINGS REPORT",
        "ESTIMATE REVISIONS",
        "KOHL'S CORPORATION",
        "KSS",
        "QUARTERLY EARNINGS",
        "ZACKS CONSENSUS ESTIMATE",
        "ZACKS EARNINGS CALENDAR",
        "ZACKS EARNINGS ESP",
        "ZACKS INVESTMENT RESEARCH",
        "ZACKS RANK"
      ],
      "sentiment": {
        "polarity": 0.998,
        "neg": 0.058,
        "neu": 0.795,
        "pos": 0.146
      }
    },
    {
      "date": "2025-08-20T12:17:00+00:00",
      "title": "Best Stock to Buy Right Now: Target vs. Kohl's",
      "content": "Key Points\n\nTarget leans on carefully curated private brands and fresh product drops instead of nonstop discounting. Kohl's is remodeling stores, overhauling private labels, and reshuffling the management team all at once. Target is the safer choice for most investors, but Kohl's riskier turnaround effort could lead to greater returns. 10 stocks we like better than Target ›\n\nAt first glance, retailers Target(NYSE: TGT) and Kohl's(NYSE: KSS) have a lot in common.\n\nThe store chains compete head-to-head in many areas, from pet toys and rugs to T-shirts and jeans. Target's beauty department is a store-in-store partnership with Ulta Beauty(NASDAQ: ULTA), and Kohl's has a similar setup with Sephora. They are profitable dividend payers with decades of experience.\n\nAnd the companies share some painful qualities, too -- both stocks have underperformed the broader market in recent years. I'm looking at two active turnaround efforts.Image source: Getty Images.\n\nBut there are significant differences, too. Let's see how Kohl's and Target differ, and which would be the better buy in August 2025. Spoiler alert: Target looks like the steadier winner, while Kohl's is the higher-upside turnaround bet if you can stomach the risk.\n\nComparing Kohl's and Target by the numbers\n\nWhether you measure them by revenue or market capitalization, Target has always been bigger than Kohl's. It's not a close race, either:TGT Market Cap data by YCharts\n\nI could go on with profitability metrics showing the same lopsided balance, but you get the point already: If you want the bigger company, Target is the only choice on the table.\n\nNow, Kohl's doesn't lose every comparison against its larger retail rival. Its gross profit margins are significantly wider. But that advantage doesn't translate into sustained benefits further down Kohl's financial statements. Target takes the lead at the operating margin level, and its bottom-line net profit margin of 4% runs circles around the department store's 0.8% figure.\n\nAnd Target shows an even stronger advantage in metrics connected to operating efficiency. Target's return on equity is 29.1% versus Kohl's 3.2%, for example.\n\nThe two turnaround themes\n\nKohl's isn't sitting on its cramped hands, of course. The company is running in full turnaround mode under an interim management team. It's reshuffling its private label portfolio, optimizing its overall product lineup, and simplifying the customer experience.\n\nIn-house brands are an important part of this effort, including the exclusive Sephora partnership. Kohl's is also remodeling its stores to offer a more intuitive layout. Specifically, the accessories and juniors departments are moving closer to the Sephora shops, as the company has found lots of cross-shopping between these categories.\n\nStory Continues\n\nTarget's turnaround plan is built around the company's reputation as a more pleasant place to shop for everyday essentials. Management is leaning into the whimsical \"Tar-zhay\" branding that suggests some kind of higher-end, slightly European quality. It's a pretty simple strategy, actually.\n\n\"We know that when we deliver the Tar-zhay magic, the consumer responds,\" CEO Brian Cornell said in May's first-quarter 2026 earnings call. \"And the common theme is, when we deliver newness at a great value, we see strong performance.\"\n\nSo the company is rolling out thousands of new items across a range of store brands. Target's focus isn't on bargain-bin pricing, but on a healthy balance between low cost and high quality. I would compare Target's strategy with the extremely successful Costco Wholesale(NASDAQ: COST) model, where the quality-obsessed Kirkland brand does a lot of heavy financial lifting. If you're ripping pages out of someone else's playbook, you might as well steal them from a world-class competitor.\n\nTarget is the easy choice, unless you love risky bets\n\nThat brings me back to that all-important question: Should you buy Target or Kohl's stock these days?\n\nAs noted, I can imagine different investors making different choices here. Kohl's stock is down by 58% in the last three years, and it trades at just 0.1 times trailing sales. The business is a mess, but there could be a fantastic upside if Kohl's can get back on a more profitable track. It's a high-risk, high-reward option.\n\nBut most people should take a second look at Target instead. The \"Tar-zhay\" tactics are already working, and this is a more robust store chain to begin with. Kohl's turnaround may be a make-or-break affair, but Target is just fine-tuning a business model that already works. That's a safer option, and Target's price-to-sales ratio of 0.5 still leaves plenty of room for robust investment returns.\n\nShould you buy stock in Target right now?\n\nBefore you buy stock in Target, consider this:\n\nThe Motley Fool Stock Advisor analyst team just identified what they believe are the 10 best stocks for investors to buy now… and Target wasn’t one of them. The 10 stocks that made the cut could produce monster returns in the coming years.\n\nConsider when Netflix made this list on December 17, 2004... if you invested $1,000 at the time of our recommendation, you’d have $671,466!* Or when Nvidia made this list on April 15, 2005... if you invested $1,000 at the time of our recommendation, you’d have $1,115,633!*\n\nNow, it’s worth noting Stock Advisor’s total average return is 1,077% — a market-crushing outperformance compared to 185% for the S&P 500. Don’t miss out on the latest top 10 list, available when you join Stock Advisor.\n\nSee the 10 stocks »\n\n*Stock Advisor returns as of August 18, 2025\n\nAnders Bylund has no position in any of the stocks mentioned. The Motley Fool has positions in and recommends Costco Wholesale, Target, and Ulta Beauty. The Motley Fool has a disclosure policy.\n\nBest Stock to Buy Right Now: Target vs. Kohl's was originally published by The Motley Fool\n\nView Comments",
      "link": "https://finance.yahoo.com/news/best-stock-buy-now-target-121700058.html",
      "symbols": [
        "COST.US",
        "KSS.US",
        "T.US",
        "TGT.US",
        "ULTA.US"
      ],
      "tags": [
        "COSTCO WHOLESALE",
        "KOHL'S",
        "NASDAQ",
        "NETFLIX",
        "NVIDIA",
        "RETURN ON EQUITY",
        "S&P 500",
        "SEPHORA",
        "TARGET",
        "THE MOTLEY FOOL",
        "ULTA BEAUTY"
      ],
      "sentiment": {
        "polarity": 0.999,
        "neg": 0.045,
        "neu": 0.79,
        "pos": 0.164
      }
    }
  ],
  "fundamentals": {
    "company_info": {
      "name": "Kohl's Corporation",
      "sector": "Consumer Cyclical",
      "industry": "Department Stores",
      "market_cap_mln": null,
      "employees": 87000,
      "description": "Kohl's Corporation operates as an omnichannel retailer in the United States. It offers apparel, footwear, accessories, beauty products, and home products through its stores and website. The company provides its products primarily under the brand names of Apt. 9, Croft & Barrow, Jumping Beans, SO, So"
    },
    "financial_health": {
      "eps_ttm": 1.09,
      "profit_margin": 0.0075,
      "operating_margin": 0.0186,
      "roe": 0.0319,
      "roa": 0.0231,
      "revenue_growth_yoy": -0.044,
      "earnings_growth_yoy": -0.743,
      "eps_estimate_current_year": 1.3209,
      "eps_estimate_next_year": 1.2694,
      "dividend_yield": 0.0937,
      "dividend_per_share": 1.25,
      "revenue_ttm": 16071999488,
      "revenue_per_share": 144.793,
      "most_recent_quarter": "2025-04-30"
    },
    "valuation_metrics": {
      "pe_ratio": 12.2202,
      "forward_pe": 41.841,
      "price_to_sales": 0.0929,
      "price_to_book": 0.3955,
      "enterprise_value": 8712635997,
      "ev_to_revenue": 0.5421,
      "ev_to_ebitda": 7.3836
    },
    "stock_technicals": {
      "beta": 1.754,
      "52_week_high": 21.39,
      "52_week_low": 5.9597,
      "50_day_ma": 10.5286,
      "200_day_ma": 11.2676,
      "short_interest": 0.4311,
      "short_ratio": 1.79
    },
    "dividend_info": {
      "forward_dividend_rate": 0.5,
      "forward_dividend_yield": 0.0375,
      "payout_ratio": 0.8028,
      "dividend_date": "2025-09-24",
      "ex_dividend_date": "2025-09-10",
      "last_split_date": "2000-04-25",
      "last_split_factor": "2:1"
    },
    "analyst_sentiment": {
      "avg_rating": 2.5,
      "target_price": 9.3307,
      "strong_buy": 1,
      "buy": 0,
      "hold": 7,
      "sell": 6,
      "strong_sell": 2
    },
    "ownership_structure": {
      "shares_outstanding": 112042000,
      "percent_institutions": 106.45500000000001,
      "percent_insiders": 3.068,
      "shares_float": 110834990
    },
    "balance_sheet": {
      "total_assets": 13639.0,
      "total_debt": 7371.0,
      "cash_and_equivalents": 153.0,
      "net_debt": 7218.0,
      "working_capital": 300.0,
      "shareholders_equity": 3779.0,
      "debt_to_equity": 1.95,
      "quarter_date": "2025-04-30"
    },
    "income_statement": {
      "total_revenue": 3233.0,
      "gross_profit": 1399.0,
      "operating_income": 60.0,
      "net_income": -15.0,
      "ebitda": 235.0,
      "gross_margin": 43.27,
      "operating_margin": 1.86,
      "net_margin": -0.46,
      "quarter_date": "2025-04-30"
    },
    "cash_flow": {
      "operating_cash_flow": -92.0,
      "free_cash_flow": -202.0,
      "capex": 110.0,
      "net_income": -15.0,
      "cash_change": 19.0,
      "dividends_paid": 14.0,
      "quarter_date": "2025-04-30"
    }
  },
  "live_price": {
    "code": "KSS.US",
    "timestamp": 1755807000,
    "gmtoffset": 0,
    "open": 13.25,
    "high": 13.615,
    "low": 12.96,
    "close": 13.32,
    "volume": 4004320,
    "previousClose": 13.34,
    "change": -0.02,
    "change_p": -0.1499
  },
  "earnings": {
    "type": "Earnings",
    "description": "Historical and upcoming Earnings",
    "symbols": "KSS",
    "earnings": [
      {
        "code": "KSS.US",
        "report_date": "2024-08-28",
        "date": "2024-07-31",
        "before_after_market": "BeforeMarket",
        "currency": "USD",
        "actual": 0.59,
        "estimate": 0.45,
        "difference": 0.14,
        "percent": 31.1111
      },
      {
        "code": "KSS.US",
        "report_date": "2024-11-19",
        "date": "2024-10-31",
        "before_after_market": "BeforeMarket",
        "currency": "USD",
        "actual": 0.2,
        "estimate": 0.2734,
        "difference": -0.0734,
        "percent": -26.8471
      },
      {
        "code": "KSS.US",
        "report_date": "2025-03-10",
        "date": "2025-01-31",
        "before_after_market": "BeforeMarket",
        "currency": "USD",
        "actual": 0.43,
        "estimate": 0.7661,
        "difference": -0.3361,
        "percent": -43.8716
      },
      {
        "code": "KSS.US",
        "report_date": "2025-05-28",
        "date": "2025-04-30",
        "before_after_market": "BeforeMarket",
        "currency": "USD",
        "actual": -0.13,
        "estimate": -0.2208,
        "difference": 0.0908,
        "percent": 41.1232
      }
    ]
  },
  "historical_prices": [
    {
      "date": "2025-08-21",
      "open": 13.25,
      "high": 13.615,
      "low": 12.9601,
      "close": 13.32,
      "adjusted_close": 13.32,
      "volume": 4005916
    },
    {
      "date": "2025-08-20",
      "open": 13.44,
      "high": 13.51,
      "low": 13.08,
      "close": 13.34,
      "adjusted_close": 13.34,
      "volume": 4367700
    },
    {
      "date": "2025-08-19",
      "open": 13.76,
      "high": 14.08,
      "low": 13.56,
      "close": 13.65,
      "adjusted_close": 13.65,
      "volume": 4428400
    },
    {
      "date": "2025-08-18",
      "open": 13.97,
      "high": 13.98,
      "low": 13.43,
      "close": 13.64,
      "adjusted_close": 13.64,
      "volume": 4951300
    },
    {
      "date": "2025-08-15",
      "open": 14.51,
      "high": 14.53,
      "low": 13.48,
      "close": 13.77,
      "adjusted_close": 13.77,
      "volume": 7287700
    },
    {
      "date": "2025-08-14",
      "open": 13.62,
      "high": 14.48,
      "low": 13.28,
      "close": 14.46,
      "adjusted_close": 14.46,
      "volume": 9272600
    },
    {
      "date": "2025-08-13",
      "open": 12.89,
      "high": 14.14,
      "low": 12.79,
      "close": 14,
      "adjusted_close": 14,
      "volume": 10818400
    },
    {
      "date": "2025-08-12",
      "open": 12.68,
      "high": 13.08,
      "low": 12.47,
      "close": 12.83,
      "adjusted_close": 12.83,
      "volume": 6241000
    },
    {
      "date": "2025-08-11",
      "open": 11.49,
      "high": 12.31,
      "low": 11.4,
      "close": 12.21,
      "adjusted_close": 12.21,
      "volume": 7354500
    },
    {
      "date": "2025-08-08",
      "open": 11.31,
      "high": 11.31,
      "low": 10.85,
      "close": 11.12,
      "adjusted_close": 11.12,
      "volume": 4724400
    },
    {
      "date": "2025-08-07",
      "open": 11.85,
      "high": 11.92,
      "low": 11.15,
      "close": 11.29,
      "adjusted_close": 11.29,
      "volume": 4127900
    },
    {
      "date": "2025-08-06",
      "open": 11.4,
      "high": 11.95,
      "low": 11.4,
      "close": 11.75,
      "adjusted_close": 11.75,
      "volume": 4461500
    },
    {
      "date": "2025-08-05",
      "open": 11.42,
      "high": 11.78,
      "low": 11.11,
      "close": 11.5,
      "adjusted_close": 11.5,
      "volume": 6137000
    },
    {
      "date": "2025-08-04",
      "open": 10.74,
      "high": 11.5,
      "low": 10.74,
      "close": 11.39,
      "adjusted_close": 11.39,
      "volume": 7826500
    },
    {
      "date": "2025-08-01",
      "open": 10.48,
      "high": 10.88,
      "low": 10.33,
      "close": 10.73,
      "adjusted_close": 10.73,
      "volume": 6803200
    },
    {
      "date": "2025-07-31",
      "open": 11.16,
      "high": 11.34,
      "low": 10.65,
      "close": 10.84,
      "adjusted_close": 10.84,
      "volume": 8161100
    },
    {
      "date": "2025-07-30",
      "open": 11.6,
      "high": 11.89,
      "low": 11.2,
      "close": 11.37,
      "adjusted_close": 11.37,
      "volume": 8299300
    },
    {
      "date": "2025-07-29",
      "open": 12.66,
      "high": 12.86,
      "low": 11.67,
      "close": 11.69,
      "adjusted_close": 11.69,
      "volume": 11906900
    },
    {
      "date": "2025-07-28",
      "open": 12.81,
      "high": 12.9,
      "low": 12.12,
      "close": 12.83,
      "adjusted_close": 12.83,
      "volume": 10948900
    },
    {
      "date": "2025-07-25",
      "open": 13.7,
      "high": 13.7,
      "low": 12.52,
      "close": 12.79,
      "adjusted_close": 12.79,
      "volume": 16565000
    },
    {
      "date": "2025-07-24",
      "open": 12.34,
      "high": 14.06,
      "low": 12.2,
      "close": 13.63,
      "adjusted_close": 13.63,
      "volume": 31351800
    },
    {
      "date": "2025-07-23",
      "open": 14,
      "high": 14.1,
      "low": 11.81,
      "close": 12.3,
      "adjusted_close": 12.3,
      "volume": 44989000
    }
  ],
  "sentiment": {
    "KSS.US": [
      {
        "date": "2025-08-21",
        "count": 2,
        "normalized": 0.999
      },
      {
        "date": "2025-08-20",
        "count": 3,
        "normalized": 0.9983
      },
      {
        "date": "2025-08-19",
        "count": 5,
        "normalized": 0.6394
      },
      {
        "date": "2025-08-18",
        "count": 2,
        "normalized": 0.9985
      },
      {
        "date": "2025-08-17",
        "count": 1,
        "normalized": 0.995
      },
      {
        "date": "2025-08-15",
        "count": 4,
        "normalized": 0.9478
      },
      {
        "date": "2025-08-14",
        "count": 2,
        "normalized": 0.9985
      },
      {
        "date": "2025-08-13",
        "count": 1,
        "normalized": 0.996
      },
      {
        "date": "2025-08-12",
        "count": 5,
        "normalized": 0.6574
      },
      {
        "date": "2025-08-11",
        "count": 2,
        "normalized": 0.7885
      },
      {
        "date": "2025-08-10",
        "count": 1,
        "normalized": 0.991
      },
      {
        "date": "2025-08-08",
        "count": 2,
        "normalized": 0.4405
      },
      {
        "date": "2025-08-07",
        "count": 3,
        "normalized": -0.494
      },
      {
        "date": "2025-08-06",
        "count": 1,
        "normalized": 0.977
      },
      {
        "date": "2025-08-05",
        "count": 1,
        "normalized": 0.809
      },
      {
        "date": "2025-08-04",
        "count": 5,
        "normalized": 0.9938
      },
      {
        "date": "2025-08-02",
        "count": 2,
        "normalized": 0.64
      },
      {
        "date": "2025-08-01",
        "count": 3,
        "normalized": 0.9893
      },
      {
        "date": "2025-07-31",
        "count": 7,
        "normalized": 0.9449
      },
      {
        "date": "2025-07-30",
        "count": 2,
        "normalized": 0.82
      },
      {
        "date": "2025-07-29",
        "count": 9,
        "normalized": 0.967
      },
      {
        "date": "2025-07-28",
        "count": 3,
        "normalized": 0.7577
      },
      {
        "date": "2025-07-27",
        "count": 5,
        "normalized": 0.923
      },
      {
        "date": "2025-07-26",
        "count": 4,
        "normalized": 0.5665
      },
      {
        "date": "2025-07-25",
        "count": 14,
        "normalized": 0.5494
      },
      {
        "date": "2025-07-24",
        "count": 13,
        "normalized": 0.9056
      },
      {
        "date": "2025-07-23",
        "count": 34,
        "normalized": 0.7351
      }
    ]
  },
  "technical_indicators": {
    "rsi": [
      {
        "date": "2025-08-21",
        "rsi": 60.3809
      },
      {
        "date": "2025-08-20",
        "rsi": 60.5637
      },
      {
        "date": "2025-08-19",
        "rsi": 63.3219
      },
      {
        "date": "2025-08-18",
        "rsi": 63.2718
      },
      {
        "date": "2025-08-15",
        "rsi": 64.3326
      },
      {
        "date": "2025-08-14",
        "rsi": 70.1275
      },
      {
        "date": "2025-08-13",
        "rsi": 68.3634
      },
      {
        "date": "2025-08-12",
        "rsi": 63.2356
      },
      {
        "date": "2025-08-11",
        "rsi": 60.0493
      },
      {
        "date": "2025-08-08",
        "rsi": 53.4653
      },
      {
        "date": "2025-08-07",
        "rsi": 54.7726
      },
      {
        "date": "2025-08-06",
        "rsi": 58.3578
      },
      {
        "date": "2025-08-05",
        "rsi": 56.9352
      },
      {
        "date": "2025-08-04",
        "rsi": 56.3257
      },
      {
        "date": "2025-08-01",
        "rsi": 52.5865
      },
      {
        "date": "2025-07-31",
        "rsi": 53.2926
      },
      {
        "date": "2025-07-30",
        "rsi": 56.6989
      },
      {
        "date": "2025-07-29",
        "rsi": 58.8062
      },
      {
        "date": "2025-07-28",
        "rsi": 67.0498
      },
      {
        "date": "2025-07-25",
        "rsi": 66.8987
      },
      {
        "date": "2025-07-24",
        "rsi": 73.4724
      },
      {
        "date": "2025-07-23",
        "rsi": 68.9927
      },
      {
        "date": "2025-07-22",
        "rsi": 90.8416
      },
      {
        "date": "2025-07-21",
        "rsi": 78.9432
      },
      {
        "date": "2025-07-18",
        "rsi": 71.602
      },
      {
        "date": "2025-07-17",
        "rsi": 73.0088
      },
      {
        "date": "2025-07-16",
        "rsi": 70.4182
      },
      {
        "date": "2025-07-15",
        "rsi": 69.0384
      },
      {
        "date": "2025-07-14",
        "rsi": 82.0717
      }
    ],
    "volatility": [
      {
        "date": "2025-08-21",
        "volatility": 2.5587
      },
      {
        "date": "2025-08-20",
        "volatility": 2.64
      },
      {
        "date": "2025-08-19",
        "volatility": 2.7317
      },
      {
        "date": "2025-08-18",
        "volatility": 2.7872
      },
      {
        "date": "2025-08-15",
        "volatility": 2.8069
      },
      {
        "date": "2025-08-14",
        "volatility": 2.7223
      },
      {
        "date": "2025-08-13",
        "volatility": 2.4592
      },
      {
        "date": "2025-08-12",
        "volatility": 2.2434
      },
      {
        "date": "2025-08-11",
        "volatility": 2.2733
      },
      {
        "date": "2025-08-08",
        "volatility": 2.3482
      },
      {
        "date": "2025-08-07",
        "volatility": 2.4948
      },
      {
        "date": "2025-08-06",
        "volatility": 2.6462
      },
      {
        "date": "2025-08-05",
        "volatility": 2.7209
      },
      {
        "date": "2025-08-04",
        "volatility": 2.8085
      }
    ],
    "atr": [
      {
        "date": "2025-08-21",
        "atr": 0.9234
      },
      {
        "date": "2025-08-20",
        "atr": 0.944
      },
      {
        "date": "2025-08-19",
        "atr": 0.9728
      },
      {
        "date": "2025-08-18",
        "atr": 1.0076
      },
      {
        "date": "2025-08-15",
        "atr": 1.0428
      },
      {
        "date": "2025-08-14",
        "atr": 1.0423
      },
      {
        "date": "2025-08-13",
        "atr": 1.0301
      },
      {
        "date": "2025-08-12",
        "atr": 1.0055
      },
      {
        "date": "2025-08-11",
        "atr": 1.0159
      },
      {
        "date": "2025-08-08",
        "atr": 1.0026
      },
      {
        "date": "2025-08-07",
        "atr": 1.0443
      },
      {
        "date": "2025-08-06",
        "atr": 1.0654
      },
      {
        "date": "2025-08-05",
        "atr": 1.105
      },
      {
        "date": "2025-08-04",
        "atr": 1.1385
      },
      {
        "date": "2025-08-01",
        "atr": 1.1668
      },
      {
        "date": "2025-07-31",
        "atr": 1.2143
      },
      {
        "date": "2025-07-30",
        "atr": 1.2523
      },
      {
        "date": "2025-07-29",
        "atr": 1.2956
      },
      {
        "date": "2025-07-28",
        "atr": 1.3037
      },
      {
        "date": "2025-07-25",
        "atr": 1.344
      },
      {
        "date": "2025-07-24",
        "atr": 1.3566
      },
      {
        "date": "2025-07-23",
        "atr": 1.3179
      },
      {
        "date": "2025-07-22",
        "atr": 1.2246
      },
      {
        "date": "2025-07-21",
        "atr": 0.475
      },
      {
        "date": "2025-07-18",
        "atr": 0.4454
      },
      {
        "date": "2025-07-17",
        "atr": 0.4558
      },
      {
        "date": "2025-07-16",
        "atr": 0.4685
      },
      {
        "date": "2025-07-15",
        "atr": 0.4815
      },
      {
        "date": "2025-07-14",
        "atr": 0.4693
      }
    ]
  }
}